<?php

namespace app\models;

use Yii;
use yii\web\NotFoundHttpException;
use yii\web\View;

//use yii\base\NotSupportedException;

class Reports {
    /**
     * @inheritdoc
     */

    /**
     * @inheritdoc
     */
    public function rules() {
        return [
            //[['date_from', 'date_to', 'status'], 'required'],
            [['d', 'm', 'y', 'd2', 'm2', 'y2', 'status'], 'required'],
        ];
    }

    /**
     * @inheritdoc
     */
    public function attributeLabels() {
        return [
            //'date_from' => 'วันที่เริ่ม',
            //'date_to' => 'วันที่สิ้นสุด',
            'd' => 'วันที่',
            'm' => 'เดือน',
            'y' => 'ปี',
            'd2' => 'วันที่',
            'm2' => 'เดือน',
            'y2' => 'ปี',
            'status' => 'รายการ',
        ];
    }

    public function getDay() {

        $day = ([
            '01' => '01',
            '02' => '02',
            '03' => '03',
            '04' => '04',
            '05' => '05',
            '06' => '06',
            '07' => '07',
            '08' => '08',
            '09' => '09',
            '10' => '10',
            '11' => '11',
            '12' => '12',
            '13' => '13',
            '14' => '14',
            '15' => '15',
            '16' => '16',
            '17' => '17',
            '18' => '18',
            '19' => '19',
            '20' => '20',
            '21' => '21',
            '22' => '22',
            '23' => '23',
            '24' => '24',
            '25' => '25',
            '26' => '26',
            '27' => '27',
            '28' => '28',
            '29' => '29',
            '30' => '30',
            '31' => '31'
        ]);

        return $day;
    }
    
    public function getMonth() {

        $month = ([
            '01' => 'มกราคม',
            '02' => 'กุมภาพันธ์',
            '03' => 'มีนาคม',
            '04' => 'เมษายน',
            '05' => 'พฤษภาคม',
            '06' => 'มิถุนายน',
            '07' => 'กรกฎาคม',
            '08' => 'สิงหาคม',
            '09' => 'กันยายน',
            '10' => 'ตุลาคม',
            '11' => 'พฤศจิกายน',
            '12' => 'ธันวาคม'
        ]);

        return $month;
    }
    
    public function getYear() {

        $year = ([
            '2017' => '2560',
            '2018' => '2561',
            '2019' => '2562',
            '2020' => '2563',
            '2021' => '2564',
            '2022' => '2565',
            '2023' => '2566',
            '2024' => '2567',
            '2025' => '2568',
            '2026' => '2569',
            '2027' => '2570'
        ]);

        return $year;
    }

}
